{
  "title": "My first Blog!",
  "tldr": "I've been reading a lot of blogs on a day to day basis, but never recorder any of my personal blogs. I think its time to catch up!",
  "tags": [
    "blog",
    "writing"
  ],
  "content": "### Why starting a blog? \n\nI've always wanted to start a Blog, but kept procrastinating and thinking about what tools to use. First step is always the hardest! However I've been reading a lot of other blogs on a day to day basis and realized that all of those people, at some points, started writing and kept this as a habit, consistently writing their thoughts and ideas and putting it out there for people like me, to read it. \n\nI knew I have experience and desire to start it, so I decided to scaffold this little blog using tools that are relevant right now (Next.js)[https://nextjs.org] and (React.js)[https://reactjs.org/]. \n\nThere are 3 main reasons why I want to have a blog: \n\n#### Have a backlog of ideas and knowledge\nAs a Software Engineer I constantly solve different technical problems and try to come up with creative solutions. However I haven't recorded any of those solutions, nor shared publicly. Which many developers practice in their blogs. Thus helping other developers to solve similar problem and have a log of something important that can be seen by a recruiter.\n\n#### Personal and career growth\nSoftware Engineers don't usually blog. They write code, commit code and done deal. But recruiters and big companies don't look at your code, unless its an Open Source project with a lot of followers. Developers need to stand out, they need to go beyond resume small Github projects. Companies are looking for personality. Blog is a great place to show what kind of person you are. How you reflect of problems and ideas, how you solve them and what conclusions you drew after. \n\n#### Gain more experience in writing\nEver since school I was not a good writer. My essays were usually horribly graded and I was ok with that! I was not going to be a writer anyway. Err... now I realize that is some important skill I missed out. Knowing on how to express thoughts and ideas in writing is very important. It is not the same as writing documentation for the code, no. It is when you have a brilliant idea in your head and you want to write it down in a way that tomorrow it would not sound like a complete non-sense to you! \n\n### What will I write about?\nFirst and most importantly I will write about things I'm passioned about! I like new technologies in developers world. I like solving problems. I like to express my thoughts and help people. \n\nSecond, I want to write about my personal developer experience. What I do, how I do, what I find useful and interesting. Not that my opinion stands above all others, but I always would like to make my take on something that i'm interested in. \n\n### Here we go!\nLike I said before I've always wanted to start a Blog. And just like in Github each repository start with `initial commit`, this is my initial commit to this Blog!\n",
  "thumbnail": null,
  "status": "released",
  "author": "Rem Kim",
  "createdAt": "2020-04-16T20:03:13.048Z",
  "updatedAt": "2020-04-16T20:27:58.511Z",
  "slug": "my-first-blog",
  "id": 1587067393048,
  "thumbnailUrl": "https://rem-blog-bucket.s3.amazonaws.com/assets/d2796a70-beb8-4270-9f27-f8c4ff737933-typewriter-jpg"
}