{
  "title": "2 simple techniques to migrate from legacy Rails to React web app",
  "tldr": "Migration from legacy Rails app to React can be a challenge, I have helped 2 companies to perform a migration and would like to share 2 different approaches those companies used.",
  "tags": [
    "Ruby",
    "Rails",
    "ReactJS",
    "Navigation",
    "react",
    "router",
    "HistoryAPI",
    "iframe"
  ],
  "content": "# Legacy Rails app\nThere are many legacy applications out there that want to migrate to new modern web apps using React or Angular, to bring much smoother and better user experience. However with existing client base and huge number of features to re-implement it becomes a huge challenge. \n\nIn my experience I had 2 cases of Rails to React migration and both took different strategies.\n\n- React app within Rails using webpacker (React in Rails)\n- Rails app with React app on a separate domain as an iframe (React iFrame)\n\nBoth approaches are viable and as practice shows work well in production.\n\n## React in Rails\nProbably will be first pick for many teams when deciding on how to migrate to React. \n\n### Pros:\n- Easy to start, lots of documentation on Webpacker and React \n- Add components to Rails pages \n- Potential to SSR (Server Side Rendering) if needed\n- No headache maintaining separate build/deploy pipeline \n\n### Cons:\n- Rails monolith is getting even bigger with 2 codebases in single repository \n- Issues with running Webpacker for earlier versions of Rails\n- Build time is longer\n\n## React iFrame\nNot as an obvious choice for some teams, however has its own pros and cons.\n\n### Pros:\n- Offload Frontend pieces from Rails monolith\n- Separate build/deploy pipeline\n- After migration is complete Rails becomes API only server\n\n### Cons:\n- Build/Deploy/CORS headache \n- \n\n\n\n\n\n\n\n",
  "thumbnail": null,
  "status": "draft",
  "author": "Rem Kim",
  "createdAt": "2021-02-20T22:16:16.169Z",
  "updatedAt": "2021-02-21T16:38:17.598Z",
  "slug": "2-simple-techniques-to-migrate-from-legacy-rails-to-react-web-app",
  "id": 1613859376169
}