{
  "title": "Buying new house in Canada",
  "tldr": "I bought a house in Canada and would like to share my experience. ",
  "tags": [
    "canada",
    "house",
    "realestate"
  ],
  "content": "Earlier this year I have received an expected of some sort, but not \"not so soon\" so to say call from my landlord. In short, after 3 years living in a beautiful townhouse that me and my wife were renting, it was time to move on, because owner decided to sell it. \n\nHonestly this is very expected. When we moved in 3 years ago this was a freshly built area still under construction and it still is, however much better looking now. However back then in 2018 there were no Covid, there were no Real Estate market boom! Prices were high, but not as high and crazy as it is right now or in later 2021. When I was renewing my leasing agreement in 2021 I was afraid landlord would say that he wants to sell it, but no. \n\nAt first scared, but then gathered our thoughts together we decided that it is time to make a move and buy a property. \n\n## Budget\n\nBuying a house requires at least 5% of downpayment, long gone days where you can have 0% downpayment and walkout from bank with a house. There is also a catch, that in Canada you only pay 5% for the first 500k$ and then you pay additional 10%. So for the house that costs 800k we will have to pay 55k$.\n\nI knew one day this will happen and we would have to gather all cash from every account that we have a put towards a property ask family to help and finally make a bare minimum to pay for everything.\n\nIn total for the house you would need: *downpayment + land transfer fee + lawyer fee*. \n\n## Getting pre approved for Mortgage\n\nWhat I think is also important is to understand how much you can get from banks. That will give you a better picture of a price range or max price you should consider when buying a property. \n\nSo that is what I did, I reached to RBC Mortgage Advisor and started explaining my financial situation, what I have, how much I earn and finally got a pre approval. What I also found is that they can give you your very high limit of affordability and explain risks related to going too high. \n\nAlso, not sure if this is entirely true, but some realtors don't want to work with clients who don't have mortgage pre approval. Pre approval kind of says that you are serious and not just playing around and wasting anyones time. \n\nDefinitely suggest reaching out to Mortgage Advisor and work closely with one. Don't hesitate and don't be shy even in saying that you don't like their rates or that you are also in talks with other banks as his job is to give you an advice and not to force you into getting mortgage with their bank. \n\n## Searching for a house\n\nIn Canada the closer you to Toronto, the pricier will be the house. We were looking for a property in range between 700 - 800k and with few requirements.\n\n- Fairly new\n- Somewhat spacious \n- at least 3 bedrooms\n- Good neighbourhood\n- Has train station to get to Toronto \n\nand optional:\n- backyard\n- finished basement\n\nIn order to make search easier we used [HouseSigma](https://housesigma.com) which has map search and every filter you need. Perhaps the only site you need to find a property in Canada. \n\nSo given those requirements the only locations that we were interested in were: Hamilton, Oshawa, Brampton, Barrie. Because everything else is basically out of our price range. \n\n## Finding a Realtor\n\nYou can always search and book viewing and make an offer yourself, I would not suggest it. Realtor is the person who first of all will do all the actions listed before, but also represent you and your best interests. \n\nIn my experience realtor was giving a lot of advices about property and beyond. For example for people who are not aware about the area, realtor was giving a lot of insights about the neighbourhood. The good the bad and everything that you need to know.  Also, realtor can talk to gain useful insights when negotiating an offer. \n\nLike I said realtor represents your best interests. Sometimes when you see a house for lets say 750k$ and you say you like it, you want to make an offer how much should you offer. First that I was thinking about is to offer more, however realtor knows that houses around were sold for a lower price or for exact price sellers are asking and can suggest to pay less or the asking price. Saving money is always good!\n\n\n## Scheduling viewing\n\nOnce we had our budget and scrolled over HouseSigma like million times  we came up with a spreadsheet of properties we would like to see. We had 4-5 viewing per day on weekends and sometimes during the week. \n\nMostly we were operating from the list of requirements + realtors view on area and lastly on a feeling from a question __\"Do I see my self living in this property for X years?\"__.\n\nThe last one I think is very important, because everything might be good but you just don't think like this is __the one__. So you scratch this one from the list and move on. \n\n## Making an offer\n\nIt took us about a month to find a property we fell in love is and honestly when we found it we've made offer immediately. \n\nWe actually made 2 offer to different properties but first one got rejected. \n\nAlso we decided to always be greedy and offer below asking price. With this strategy there is a chance that offer will go through given that market is cooling down. However higher chance that it will bounce back with a number from seller or a note that there is a competing offer. \n\nWe actually only had one competing offer and our second offer was accepted fairly fast. \n\nOnce again I think this is very important to have a good realtor who will suggest how much you should increase an offer, but also realtor can negotiate with the other realtor and kind of sense some information about competing offer. Don't ask me, it is some Realtor wodoo magic. \n\n## What is next?\n\nWell now that we have an offer accepted, we are shopping for a better mortgage deal. I guess I will write up about it once I have something!\n\n### FIN\n  \n\n\n",
  "thumbnail": null,
  "status": "released",
  "author": "Rem Kim",
  "createdAt": "2022-04-18T15:27:57.287Z",
  "updatedAt": "2022-04-19T01:15:19.862Z",
  "slug": "buying-new-house-in-canada",
  "id": 1650295677287,
  "releasedAt": "2022-04-19T01:15:19.855Z",
  "thumbnailUrl": "https://images.unsplash.com/photo-1518780664697-55e3ad937233?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=930&q=80"
}